In [ ]:
## Capturing NAN values with a new feature
It works well if the dataset are not missing completely at random

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('titanic_dataset.csv', usecols=['Age', 'Fare', 'Survived'])
df.tail(3)

     Survived   Age   Fare
888         0   NaN  23.45
889         1  26.0  30.00
890         0  32.0   7.75

In [7]:
import numpy as np
df['Age_NAN']= np.where(df['Age'].isnull(), 1, 0)
df.tail(3)

     Survived   Age   Fare  Age_NAN
888         0   NaN  23.45        1
889         1  26.0  30.00        0
890         0  32.0   7.75        0

## Advantages

1. Easy to implement
2. Caputures the importance of missing values

## Disadvantages
1. Creating additional features (Curse of Dimentionality)